$(() => {

    //1. Поміняйте місцями контент блоків «х» та «у».
    const x = $(".bloc__1__x")
    const y = $(".bloc__6__y")
    const content_x = x.html();
    x.html(y.html())
    y.html(content_x)

    /*   2. Напишіть функцію, яка обчислює площу кола,
        беручи необхідні значення із відповідних змінних у
    скрипті, і виводить отриманий результат в кінці
    контенту в блоці «3».*/

    const square_circle = r => {
        /**
         * This function find area of a circle
         * @param r - it is radius circle
         * @return null
         */

        $(".bloc__3").append(
            "<div>" +
                "<br> Площа кола:" +
                `<br> ${Math.PI * r * r}` +
            " </div>")

        return null
    }

    square_circle(5);

    /* 3. Напишіть скрипт, який визначає кількість
    максимальних чисел із 10 значень, беручи необхідні
    значення із відповідної форми в блоці «3», а
    отриманий результат виводить за допомогою
    діалогового вікна і зберігає в куках, причому:
    а) при оновленні документа в броузері користувачу за допомогою діалогового
    вікна виводиться інформація, збережена в куках, із питанням про необхідність
    видалити дані із куків, і не виводиться згадана вище форма;
    б) при підтвердженні питання відповідні куки видаляються, і документ
    оновлюється з початковим станом із наявною формою для введення даних;
    в) при відмові виводиться наступне діалогове вікно із інформуванням
    користувача про наявність куків і необхідність перезавантаження документа. */

    const num_of_num = () => {
        /**
         * this function finds the number of largest numbers
         * @return null
         * */

        confirm("підтвердіть куки")

        // add form
        $(".bloc__3").append(
            "<p><form class=\"main_form\">" +
            "    <input class=\"main_form__input_num\" type=\"текс\" placeholder=\"уведіть 10 чисел через пробіл\" >\n" +
            "</form></p>")


        return null
    }

    num_of_num()
})